### Report for ods-downloader on environment: dev

#### Terraform Format and Style 🖌`success`
<details><summary>Format Output</summary>

```


```

</details>

#### Terraform Initialization ⚙️`success`
<details><summary>Initialization Output</summary>

```

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.
Initializing provider plugins...
- Finding hashicorp/aws versions matching "~> 3.74"...
- Installing hashicorp/aws v3.76.1...
- Installed hashicorp/aws v3.76.1 (signed by HashiCorp)
Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

```

</details>

#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan (1 to add, 10 to change, 1 to destroy)</summary>

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.ods_input_bucket_read_access will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "ods_input_bucket_read_access" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + "arn:aws:s3:::prm-gp2gp-asid-lookup-dev",
            ]
          + sid       = "ListBucket"
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::prm-gp2gp-asid-lookup-dev/*",
            ]
          + sid       = "ReadObjects"
        }
    }

  # data.aws_iam_policy_document.ods_output_bucket_read_access will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "ods_output_bucket_read_access" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + "arn:aws:s3:::prm-gp2gp-ods-metadata-dev",
            ]
          + sid       = "ListBucket"
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::prm-gp2gp-ods-metadata-dev/*",
            ]
          + sid       = "ReadObjects"
        }
    }

  # data.aws_iam_policy_document.ods_output_bucket_write_access will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "ods_output_bucket_write_access" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + resources = [
              + "arn:aws:s3:::prm-gp2gp-ods-metadata-dev/*",
            ]
          + sid       = "WriteObjects"
        }
    }

  # aws_ecs_task_definition.ods_downloader must be replaced
-/+ resource "aws_ecs_task_definition" "ods_downloader" {
      ~ arn                      = "arn:aws:ecs:eu-west-2:343515223843:task-definition/dev-ods-downloader:118" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ id                       = "dev-ods-downloader" -> (known after apply)
      ~ revision                 = 118 -> (known after apply)
      ~ tags                     = {
            "ApplicationRole"     = "AwsEcsTaskDefinition"
            "BackupLocal"         = "False"
            "BackupRemote"        = "False"
            "CostCentre"          = "P0688/04"
          ~ "CreatedBy"           = "prm-gp2gp-data-pipeline-infra" -> "gp2gp-reporting-infrastructure"
            "Customer"            = "NHS D"
            "DataType"            = "None"
            "Environment"         = "dev"
            "Name"                = "dev-ods-downloader"
            "OnOffPattern"        = "AlwaysOn"
            "Owner"               = "Candice Moore"
            "Programme"           = "GP IT Futures"
            "Project"             = "Patient Record Migration"
            "ProjectType"         = "Public beta"
            "PublicFacing"        = "N"
            "ServiceCategory"     = "Bronze"
            "TagVersion"          = "1"
            "Team"                = "Registrations"
            "data_classification" = "1"
            "envtype"             = "dev"
        }
      ~ tags_all                 = {
          ~ "CreatedBy"           = "prm-gp2gp-data-pipeline-infra" -> "gp2gp-reporting-infrastructure"
            # (19 unchanged elements hidden)
        }
        # (10 unchanged attributes hidden)
    }

  # aws_iam_policy.ods_input_bucket_read_access will be updated in-place
  ~ resource "aws_iam_policy" "ods_input_bucket_read_access" {
        id          = "arn:aws:iam::343515223843:policy/prm-gp2gp-asid-lookup-dev-read"
        name        = "prm-gp2gp-asid-lookup-dev-read"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "s3:ListBucket"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::prm-gp2gp-asid-lookup-dev"
                      - Sid      = "ListBucket"
                    },
                  - {
                      - Action   = "s3:GetObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::prm-gp2gp-asid-lookup-dev/*"
                      - Sid      = "ReadObjects"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags        = {}
        # (5 unchanged attributes hidden)
    }

  # aws_iam_policy.ods_output_bucket_read_access will be updated in-place
  ~ resource "aws_iam_policy" "ods_output_bucket_read_access" {
        id          = "arn:aws:iam::343515223843:policy/prm-gp2gp-ods-metadata-dev-read"
        name        = "prm-gp2gp-ods-metadata-dev-read"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "s3:ListBucket"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::prm-gp2gp-ods-metadata-dev"
                      - Sid      = "ListBucket"
                    },
                  - {
                      - Action   = "s3:GetObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::prm-gp2gp-ods-metadata-dev/*"
                      - Sid      = "ReadObjects"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags        = {}
        # (5 unchanged attributes hidden)
    }

  # aws_iam_policy.ods_output_bucket_write_access will be updated in-place
  ~ resource "aws_iam_policy" "ods_output_bucket_write_access" {
        id          = "arn:aws:iam::343515223843:policy/prm-gp2gp-ods-metadata-dev-write"
        name        = "prm-gp2gp-ods-metadata-dev-write"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "s3:PutObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::prm-gp2gp-ods-metadata-dev/*"
                      - Sid      = "WriteObjects"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags        = {}
        # (5 unchanged attributes hidden)
    }

  # aws_s3_bucket.ods_input will be updated in-place
  ~ resource "aws_s3_bucket" "ods_input" {
        id                          = "prm-gp2gp-asid-lookup-dev"
      ~ tags                        = {
            "ApplicationRole"     = "AwsS3Bucket"
            "BackupLocal"         = "False"
            "BackupRemote"        = "False"
            "CostCentre"          = "P0688/04"
          ~ "CreatedBy"           = "prm-gp2gp-data-pipeline-infra" -> "gp2gp-reporting-infrastructure"
            "Customer"            = "NHS D"
            "DataType"            = "None"
            "Environment"         = "dev"
            "Name"                = "dev-asid-lookup-used-to-supplement-ods-data"
            "OnOffPattern"        = "AlwaysOn"
            "Owner"               = "Candice Moore"
            "Programme"           = "GP IT Futures"
            "Project"             = "Patient Record Migration"
            "ProjectType"         = "Public beta"
            "PublicFacing"        = "N"
            "ServiceCategory"     = "Bronze"
            "TagVersion"          = "1"
            "Team"                = "Registrations"
            "data_classification" = "1"
            "envtype"             = "dev"
        }
      ~ tags_all                    = {
          ~ "CreatedBy"           = "prm-gp2gp-data-pipeline-infra" -> "gp2gp-reporting-infrastructure"
            # (19 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_s3_bucket.ods_output will be updated in-place
  ~ resource "aws_s3_bucket" "ods_output" {
        id                          = "prm-gp2gp-ods-metadata-dev"
      ~ tags                        = {
            "ApplicationRole"     = "AwsS3Bucket"
            "BackupLocal"         = "False"
            "BackupRemote"        = "False"
            "CostCentre"          = "P0688/04"
          ~ "CreatedBy"           = "prm-gp2gp-data-pipeline-infra" -> "gp2gp-reporting-infrastructure"
            "Customer"            = "NHS D"
            "DataType"            = "None"
            "Environment"         = "dev"
            "Name"                = "dev-organisational-metadata"
            "OnOffPattern"        = "AlwaysOn"
            "Owner"               = "Candice Moore"
            "Programme"           = "GP IT Futures"
            "Project"             = "Patient Record Migration"
            "ProjectType"         = "Public beta"
            "PublicFacing"        = "N"
            "ServiceCategory"     = "Bronze"
            "TagVersion"          = "1"
            "Team"                = "Registrations"
            "data_classification" = "1"
            "envtype"             = "dev"
        }
      ~ tags_all                    = {
          ~ "CreatedBy"           = "prm-gp2gp-data-pipeline-infra" -> "gp2gp-reporting-infrastructure"
            # (19 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_ssm_parameter.ods_downloader_iam_role_arn will be updated in-place
  ~ resource "aws_ssm_parameter" "ods_downloader_iam_role_arn" {
        id              = "/registrations/dev/data-pipeline/ods-downloader/iam-role-arn"
        name            = "/registrations/dev/data-pipeline/ods-downloader/iam-role-arn"
      ~ tags            = {
            "ApplicationRole"     = "AwsSsmParameter"
            "BackupLocal"         = "False"
            "BackupRemote"        = "False"
            "CostCentre"          = "P0688/04"
          ~ "CreatedBy"           = "prm-gp2gp-data-pipeline-infra" -> "gp2gp-reporting-infrastructure"
            "Customer"            = "NHS D"
            "DataType"            = "None"
            "Environment"         = "dev"
            "Name"                = "dev-ods-downloader-iam-role-arn"
            "OnOffPattern"        = "AlwaysOn"
            "Owner"               = "Candice Moore"
            "Programme"           = "GP IT Futures"
            "Project"             = "Patient Record Migration"
            "ProjectType"         = "Public beta"
            "PublicFacing"        = "N"
            "ServiceCategory"     = "Bronze"
            "TagVersion"          = "1"
            "Team"                = "Registrations"
            "data_classification" = "1"
            "envtype"             = "dev"
        }
      ~ tags_all        = {
          ~ "CreatedBy"           = "prm-gp2gp-data-pipeline-infra" -> "gp2gp-reporting-infrastructure"
            # (19 unchanged elements hidden)
        }
        # (9 unchanged attributes hidden)
    }

  # aws_ssm_parameter.ods_downloader_input_bucket_name will be updated in-place
  ~ resource "aws_ssm_parameter" "ods_downloader_input_bucket_name" {
        id              = "/registrations/dev/data-pipeline/ods-downloader/asid-lookup-bucket-name"
        name            = "/registrations/dev/data-pipeline/ods-downloader/asid-lookup-bucket-name"
      ~ tags            = {
            "ApplicationRole"     = "AwsSsmParameter"
            "BackupLocal"         = "False"
            "BackupRemote"        = "False"
            "CostCentre"          = "P0688/04"
          ~ "CreatedBy"           = "prm-gp2gp-data-pipeline-infra" -> "gp2gp-reporting-infrastructure"
            "Customer"            = "NHS D"
            "DataType"            = "None"
            "Environment"         = "dev"
            "Name"                = "dev-ods-downloader-input-bucket-name"
            "OnOffPattern"        = "AlwaysOn"
            "Owner"               = "Candice Moore"
            "Programme"           = "GP IT Futures"
            "Project"             = "Patient Record Migration"
            "ProjectType"         = "Public beta"
            "PublicFacing"        = "N"
            "ServiceCategory"     = "Bronze"
            "TagVersion"          = "1"
            "Team"                = "Registrations"
            "data_classification" = "1"
            "envtype"             = "dev"
        }
      ~ tags_all        = {
          ~ "CreatedBy"           = "prm-gp2gp-data-pipeline-infra" -> "gp2gp-reporting-infrastructure"
            # (19 unchanged elements hidden)
        }
        # (9 unchanged attributes hidden)
    }

  # aws_ssm_parameter.ods_downloader_output_bucket_name will be updated in-place
  ~ resource "aws_ssm_parameter" "ods_downloader_output_bucket_name" {
        id              = "/registrations/dev/data-pipeline/ods-downloader/output-bucket-name"
        name            = "/registrations/dev/data-pipeline/ods-downloader/output-bucket-name"
      ~ tags            = {
            "ApplicationRole"     = "AwsSsmParameter"
            "BackupLocal"         = "False"
            "BackupRemote"        = "False"
            "CostCentre"          = "P0688/04"
          ~ "CreatedBy"           = "prm-gp2gp-data-pipeline-infra" -> "gp2gp-reporting-infrastructure"
            "Customer"            = "NHS D"
            "DataType"            = "None"
            "Environment"         = "dev"
            "Name"                = "dev-ods-downloader-output-bucket-name"
            "OnOffPattern"        = "AlwaysOn"
            "Owner"               = "Candice Moore"
            "Programme"           = "GP IT Futures"
            "Project"             = "Patient Record Migration"
            "ProjectType"         = "Public beta"
            "PublicFacing"        = "N"
            "ServiceCategory"     = "Bronze"
            "TagVersion"          = "1"
            "Team"                = "Registrations"
            "data_classification" = "1"
            "envtype"             = "dev"
        }
      ~ tags_all        = {
          ~ "CreatedBy"           = "prm-gp2gp-data-pipeline-infra" -> "gp2gp-reporting-infrastructure"
            # (19 unchanged elements hidden)
        }
        # (9 unchanged attributes hidden)
    }

  # aws_ssm_parameter.ods_downloader_output_bucket_read_access_arn will be updated in-place
  ~ resource "aws_ssm_parameter" "ods_downloader_output_bucket_read_access_arn" {
        id              = "/registrations/dev/data-pipeline/ods-downloader/output-bucket-read-access-arn"
        name            = "/registrations/dev/data-pipeline/ods-downloader/output-bucket-read-access-arn"
      ~ tags            = {
            "ApplicationRole"     = "AwsSsmParameter"
            "BackupLocal"         = "False"
            "BackupRemote"        = "False"
            "CostCentre"          = "P0688/04"
          ~ "CreatedBy"           = "prm-gp2gp-data-pipeline-infra" -> "gp2gp-reporting-infrastructure"
            "Customer"            = "NHS D"
            "DataType"            = "None"
            "Environment"         = "dev"
            "Name"                = "dev-ods-downloader-output-bucket-read-access-arn"
            "OnOffPattern"        = "AlwaysOn"
            "Owner"               = "Candice Moore"
            "Programme"           = "GP IT Futures"
            "Project"             = "Patient Record Migration"
            "ProjectType"         = "Public beta"
            "PublicFacing"        = "N"
            "ServiceCategory"     = "Bronze"
            "TagVersion"          = "1"
            "Team"                = "Registrations"
            "data_classification" = "1"
            "envtype"             = "dev"
        }
      ~ tags_all        = {
          ~ "CreatedBy"           = "prm-gp2gp-data-pipeline-infra" -> "gp2gp-reporting-infrastructure"
            # (19 unchanged elements hidden)
        }
        # (9 unchanged attributes hidden)
    }

  # aws_ssm_parameter.ods_downloader_task_definition_arn will be updated in-place
  ~ resource "aws_ssm_parameter" "ods_downloader_task_definition_arn" {
        id              = "/registrations/dev/data-pipeline/ods-downloader/task-definition-arn"
        name            = "/registrations/dev/data-pipeline/ods-downloader/task-definition-arn"
      ~ tags            = {
            "ApplicationRole"     = "AwsSsmParameter"
            "BackupLocal"         = "False"
            "BackupRemote"        = "False"
            "CostCentre"          = "P0688/04"
          ~ "CreatedBy"           = "prm-gp2gp-data-pipeline-infra" -> "gp2gp-reporting-infrastructure"
            "Customer"            = "NHS D"
            "DataType"            = "None"
            "Environment"         = "dev"
            "Name"                = "dev-ods-downloader-task-definition-arn"
            "OnOffPattern"        = "AlwaysOn"
            "Owner"               = "Candice Moore"
            "Programme"           = "GP IT Futures"
            "Project"             = "Patient Record Migration"
            "ProjectType"         = "Public beta"
            "PublicFacing"        = "N"
            "ServiceCategory"     = "Bronze"
            "TagVersion"          = "1"
            "Team"                = "Registrations"
            "data_classification" = "1"
            "envtype"             = "dev"
        }
      ~ tags_all        = {
          ~ "CreatedBy"           = "prm-gp2gp-data-pipeline-infra" -> "gp2gp-reporting-infrastructure"
            # (19 unchanged elements hidden)
        }
      ~ value           = (sensitive value)
      ~ version         = 106 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

Plan: 1 to add, 10 to change, 1 to destroy.

```

</details>